In [1]:
import pandas as pd
series1 = pd.Series([10,20,30])
print(series1)

0    10
1    20
2    30
dtype: int64

In [2]:
series2 = pd.Series(['Arnab','Samridhi','Ramit','Divyam','Kritika'],index = [3,5,1,2,4])
print(series2)

3       Arnab
5    Samridhi
1       Ramit
2      Divyam
4     Kritika
dtype: object

In [3]:
series3 = pd.Series([2,3,4],index = ['Feb','Mar','Apr'])
print(series3)

Feb    2
Mar    3
Apr    4
dtype: int64

In [4]:
import numpy as np
import pandas as pd
array1 = np.array([1,2,3,4])
series = pd.Series(array1)
print(series)

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
series2 = pd.Series(array1,index = ['Jan','Feb','Mar','Apr'])
print(series2)

Jan    1
Feb    2
Mar    3
Apr    4
dtype: int64

In [6]:
dict1 = {'India': 'New Delhi','UK':'London','Japan':'Tokyo'}
print(dict1)

{'India': 'New Delhi', 'UK': 'London', 'Japan': 'Tokyo'}

In [7]:
series3 = pd.Series(dict1)
print(series3)

India    New Delhi
UK          London
Japan        Tokyo
dtype: object

In [8]:
print(series3['UK'])

London

In [9]:
series3[[2,0]]

Japan        Tokyo
India    New Delhi
dtype: object

In [10]:
series3.index = [10,20,30]
series3

10    New Delhi
20       London
30        Tokyo
dtype: object

In [11]:
series3[0:3]

10    New Delhi
20       London
30        Tokyo
dtype: object

In [12]:
series3[::-1]

30        Tokyo
20       London
10    New Delhi
dtype: object

In [13]:
series3.name = 'Capitals'
print(series3)

10    New Delhi
20       London
30        Tokyo
Name: Capitals, dtype: object

In [14]:
series3.index.name = 'Countries'
print(series3)

Countries
10    New Delhi
20       London
30        Tokyo
Name: Capitals, dtype: object

In [15]:
series3.values

array(['New Delhi', 'London', 'Tokyo'], dtype=object)

In [16]:
series3.size

3

In [17]:
series.empty

False

In [18]:
series4 = pd.Series(np.arange(10,21,1))
series4

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
dtype: int64

In [19]:
series4.head()

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [20]:
series4.tail()

6     16
7     17
8     18
9     19
10    20
dtype: int64

In [21]:
series4.count()

11

In [22]:
seriesA = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
seriesB = pd.Series([10,20,-10,-50,100],index = ['z','y','a','c','e'])
seriesA + seriesB

a     -9.0
b      NaN
c    -47.0
d      NaN
e    105.0
y      NaN
z      NaN
dtype: float64

In [23]:
seriesA -seriesB

a    11.0
b     NaN
c    53.0
d     NaN
e   -95.0
y     NaN
z     NaN
dtype: float64

In [24]:
seriesA.add(seriesB,fill_value = 0)

a     -9.0
b      2.0
c    -47.0
d      4.0
e    105.0
y     20.0
z     10.0
dtype: float64

In [25]:
seriesA.sub(seriesB,fill_value = 0)

a    11.0
b     2.0
c    53.0
d     4.0
e   -95.0
y   -20.0
z   -10.0
dtype: float64

In [26]:
seriesA.mul(seriesB,fill_value=1)

a    -10.0
b      2.0
c   -150.0
d      4.0
e    500.0
y     20.0
z     10.0
dtype: float64

In [27]:
seriesA.div(seriesB,fill_value = 1)

a   -0.10
b    2.00
c   -0.06
d    4.00
e    0.05
y    0.05
z    0.10
dtype: float64

In [3]:
import pandas as pd
import numpy as np
array1 = np.array([10,20,30])
array2 = np.array([100,200,300])
array3 = np.array([-10,-20,-30,-40])
df = pd.DataFrame([array1,array2,array3])
df

     0    1    2     3
0   10   20   30   NaN
1  100  200  300   NaN
2  -10  -20  -30 -40.0

In [29]:
listDict = [{'a' : 10,'b':20},{'a':5,'b':10,'c':20}]
dFDict = pd.DataFrame(listDict)
dFDict

    a   b     c
0  10  20   NaN
1   5  10  20.0

In [30]:
dictForest = {
    'State' : ['Assam','Delhi','Kerala'],
    'GArea' : [78434,1483,38852],
    'VDF' : [2796,6.72,1663]
}
dframeForest = pd.DataFrame(dictForest)
dframeForest

    State  GArea      VDF
0   Assam  78434  2796.00
1   Delhi   1483     6.72
2  Kerala  38852  1663.00

In [31]:
dframeForest1 = pd.DataFrame(dictForest,columns = ['State','VDF','GArea'])
rdframeForest1

NameError: name 'rdframeForest1' is not defined

In [4]:
Resultsheet = {
    'Arnab' : pd.Series([90,91,97],index = ['Maths','Science','Hindi']),
    'Ramit' : pd.Series([92,81,96],index = ['Maths','Science','Hindi']),
    'Samridhi' : pd.Series([89,91,88],index = ['Maths','Science','Hindi']),
    'Riya' : pd.Series([81,71,67],index = ['Maths','Science','Hindi']),
    'Mallika' : pd.Series([94,95,99],index = ['Maths','Science','Hindi'])
}
ResultDf = pd.DataFrame(Resultsheet)
ResultDf

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [ ]:
type(ResultDf.Arnab)

In [ ]:
ResultDf['Preeti'] = [89,78,76]
ResultDf

In [ ]:
ResultDf['Ramit'] = [98,76,89]
ResultDf

In [ ]:
ResultDf['Arnab'] = 90
ResultDf

In [ ]:
ResultDf.loc['English'] = [85,86,83,80,90,89]
ResultDf

In [ ]:
ResultDf

In [ ]:
# ResultDf.loc['Maths'] = 0
# ResultDf

In [ ]:
# ResultDf[:] = 0
# ResultDf

In [ ]:
ResultDf

In [ ]:
ResultDf = ResultDf.drop('Science',axis = 0)
ResultDf

In [ ]:
ResultDf = ResultDf.drop(['Samridhi','Ramit','Riya'],axis =1)
ResultDf

In [ ]:
ResultDf = ResultDf.drop('Hindi',axis = 0)
ResultDf

In [5]:
Resultsheet = {
    'Arnab' : pd.Series([90,91,97],index = ['Maths','Science','Hindi']),
    'Ramit' : pd.Series([92,81,96],index = ['Maths','Science','Hindi']),
    'Samridhi' : pd.Series([89,91,88],index = ['Maths','Science','Hindi']),
    'Riya' : pd.Series([81,71,67],index = ['Maths','Science','Hindi']),
    'Mallika' : pd.Series([94,95,99],index = ['Maths','Science','Hindi'])
}
ResultDf = pd.DataFrame(Resultsheet)
ResultDf

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [6]:
ResultDf.loc['English'] = [95,86,95,80,95]
ResultDf

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99
English     95     86        95    80       95

In [7]:
ResultDf = ResultDf.rename({'Maths':'Sub1','English':'Sub2','Science':'Sub3','Hindi':'Sub4'})
ResultDf

      Arnab  Ramit  Samridhi  Riya  Mallika
Sub1     90     92        89    81       94
Sub3     91     81        91    71       95
Sub4     97     96        88    67       99
Sub2     95     86        95    80       95

In [8]:
ResultDf = ResultDf.rename({'Arnab':'Student1','Ramit':'Student2','Samridhi':'Student3','Riya':'Student4','Mallika':'Student5'},axis = 'columns')
ResultDf

      Student1  Student2  Student3  Student4  Student5
Sub1        90        92        89        81        94
Sub3        91        81        91        71        95
Sub4        97        96        88        67        99
Sub2        95        86        95        80        95

In [9]:
Resultsheet = {
    'Arnab' : pd.Series([90,91,97],index = ['Maths','Science','Hindi']),
    'Ramit' : pd.Series([92,81,96],index = ['Maths','Science','Hindi']),
    'Samridhi' : pd.Series([89,91,88],index = ['Maths','Science','Hindi']),
    'Riya' : pd.Series([81,71,67],index = ['Maths','Science','Hindi']),
    'Mallika' : pd.Series([94,95,99],index = ['Maths','Science','Hindi'])
}
ResultDf = pd.DataFrame(Resultsheet)
ResultDf

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [10]:
ResultDf.loc['English'] = [95,86,95,80,95]
ResultDf

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99
English     95     86        95    80       95

In [11]:
ResultDf.loc['Science']

Arnab       91
Ramit       81
Samridhi    91
Riya        71
Mallika     95
Name: Science, dtype: int64

In [12]:
ResultDf.loc[:,'Arnab']

Maths      90
Science    91
Hindi      97
English    95
Name: Arnab, dtype: int64

In [13]:
ResultDf.T

          Maths  Science  Hindi  English
Arnab        90       91     97       95
Ramit        92       81     96       86
Samridhi     89       91     88       95
Riya         81       71     67       80
Mallika      94       95     99       95

In [29]:
import pandas as pd
import numpy as np
marksUT = {'Name' :['Raman','Raman','Raman','Zuhaire','Zuhaire','Zuhaire','Ashravy','Ashravy','Ashravy','Mishti','Mishti','Mishti'],
          'UT' : [1,2,3,1,2,3,1,2,3,1,2,3],
          'Maths' : [22,21,14,20,23,22,23,24,12,15,18,17],
          'Science' : [21,20,19,17,15,18,19,22,25,22,21,18],
          'S.St' : [18,17,15,22,21,19,20,24,19,25,25,20],
          'Hindi' : [20,22,24,24,25,23,15,17,21,22,24,25],
          'Eng' : [21,24,23,19,15,13,22,21,23,22,23,20]
          }
df = pd.DataFrame(marksUT)
df

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

In [17]:
print(df.max())

Name       Zuhaire
UT               3
Maths           24
Science         25
S.St            25
Hindi           25
Eng             24
dtype: object

In [20]:
dfUT2 = df[df.UT == 2]
print('\nResult of Unit Test 2 : \n\n',dfUT2)

Result of Unit Test 2 :

        Name  UT  Maths  Science  S.St  Hindi  Eng
1     Raman   2     21       20    17     22   24
4   Zuhaire   2     23       15    21     25   15
7   Ashravy   2     24       22    24     17   21
10   Mishti   2     18       21    25     24   23

In [21]:
df.sum()

Name       RamanRamanRamanZuhaireZuhaireZuhaireAshravyAsh...
UT                                                        24
Maths                                                    231
Science                                                  237
S.St                                                     245
Hindi                                                    262
Eng                                                      246
dtype: object

In [22]:
df.count()

Name       12
UT         12
Maths      12
Science    12
S.St       12
Hindi      12
Eng        12
dtype: int64

In [23]:
df.count(axis=1)

0     7
1     7
2     7
3     7
4     7
5     7
6     7
7     7
8     7
9     7
10    7
11    7
dtype: int64

In [27]:
df.max(axis=0)

Name       Zuhaire
UT               3
Maths           24
Science         25
S.St            25
Hindi           25
Eng             24
dtype: object